Revit 2024 API
FabricationPart.ProductCode Property
 The current database id of the part within the fabrication database.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public string ProductCode { get; }
Visual Basic
Public ReadOnly Property ProductCode As String
	Get
Visual C++
public:
property String^ ProductCode {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace